app/controllers/foods_controller.rb

  def index
    @foods = Food.where(user: current_user)
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]

  def create
    @food = current_user.foods.build(food_params)

    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "rice"], ["measurement_unit", "kg"], ["price", 8], ["quantity", 10], ["user_id", 1], ["created_at", "2023-04-26 19:53:00.520688"], ["updated_at", "2023-04-26 19:53:00.520688"]]

  def destroy
    @food = Food.find(params[:id])
    @food.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]

  def set_food
    @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]