app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_food
    @food = Food.find(params[:id])