app/controllers/recipe_foods_controller.rb

SELECT "recipe_foods".* FROM "recipe_foods"
---
  def index
    @recipe_foods = RecipeFood.all

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
---
  def new
    @recipe_food = RecipeFood.new
    @foods = Food.where(user: current_user)

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @recipe_food = RecipeFood.find(params[:id])

INSERT INTO "recipe_foods" ("quantity", "food_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 12], ["food_id", 3], ["recipe_id", 1], ["created_at", "2023-04-28 18:50:40.788863"], ["updated_at", "2023-04-28 18:50:40.788863"]]
---
  def create
    @recipe_food = RecipeFood.new(recipe_food_params)
    @recipe_food.recipe_id = params[:recipe_id]
    if @recipe_food.save

DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 1]]
---
  def destroy
    @recipe_food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_recipe_food
    @recipe_food = RecipeFood.find(params[:id])