app/controllers/shopping_list_controller.rb

  def index
    @user = current_user
    @recipe = Recipe.where(user: @user)
    @ingredients = RecipeFood.where(recipe: @recipe).group_by { |ingredient| ingredient.food.name }
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN (SELECT "recipes"."id" FROM "recipes" WHERE "recipes"."user_id" = $1)  [["user_id", 1]]