app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pray Eddy"], ["created_at", "2023-04-25 15:02:15.099686"], ["updated_at", "2023-04-25 15:02:15.099686"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_user
    if params[:id] == 'sign_out'
      redirect_to root_path notice: 'Logged out successfully!'
    else
      @user = User.find(params[:id])